# #------------------------------------------------------------------------------
# # .쌍따옴표와 혿따음표 문자열 지정
# #  따옴표의 쌍이 맞지 않다면 오류 발생
# #------------------------------------------------------------------------------
# print("Hello")
# print('Hello')
# print("Hello')
# print('Hello")



# #------------------------------------------------------------------------------
# # 코드 실행 순서
# # - 위쪽에서 아래쪽으로, 
# # - 대입 연산자가 있을 경우 오른쪽(리터럴)에서 왼쪽으로
# #------------------------------------------------------------------------------
# print("hello")
# print("hello")
# print("hello")
# age = agea = 10



# #------------------------------------------------------------------------------
# # Python의 코드 단위 
# # 블럭
# # 파이썬은 들여쓰기로 코드 블럭 처리 (C#, Java: { })
# #------------------------------------------------------------------------------
# # 파이썬의 블록 처리
# age = 11
# if age < 10:
#     # age가 10미만일 경우만 실행되는 if문의 코드 블럭
#     print("10미만입니다.")
# print("출력을 완료 하였습니다.")




# #------------------------------------------------------------------------------
# # 주석
# # 개발자의 생각을 나타내는 코멘트 
# # 컴퓨터는 주석문을 무시하고 프로그램을 실행
# # . 프로그램에 대한 분석과 가독성을 높여 프로그램 개발성향상에 도움을 주는 작업
# #   개발자가 가져야 할 중요한 습관
# #   ctr + k + c : 다중 주석 처리,   ctr + k + u: 다중 주석 해제
# #------------------------------------------------------------------------------
